In [5]:
"""Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series."""
import pandas as pd
data =[4, 8, 15, 16, 23, 42]

ser = pd.Series(data)
print(ser)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [6]:
"""Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it."""
l=pd.Series([i for i in range(1,11)])
print(type(l))
print(l)

<class 'pandas.core.series.Series'>
0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

# Q3:

In [7]:
"""Q3: Create a Pandas DataFrame that contains the following data:"""

data = {'Name': ['Alice', 'Bob', 'Claire'], 'age': [25, 30, 27],'Gender':['Female','Male','Female']}
data=pd.DataFrame(data)
data

     Name  age  Gender
0   Alice   25  Female
1     Bob   30    Male
2  Claire   27  Female

# Q4:

What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

## DataFrame:
A pandas DataFrame is a two-dimensional data structure that can be thought of as a spreadsheet. It can also be thought of as a collection of two or more series with common indices.

Points:<br>
1.Two-dimensional<br>
2.Heterogenous – DataFrame elements can have different data types.<br>
3.Size-mutable – Elements can be dropped or added in an existing DataFrame.<br>


## Series:
A pandas series is a one-dimensional data structure that comprises of key-value pair, where keys/labels are the indices and values are the values stored on that index. It is similar to a python dictionary, except it provides more freedom to manipulate and edit the data.<br>

Points:<br>
1.One-dimensional<br>
2.Homogenous – Series elements must be of the same data type.<br>
3.Size-immutable – Once created, the size of a Series object cannot be changed.<br>

In [16]:
fruits = pd.Series(["apples", "oranges", "bananas"], index=['a', 'b', 'c'])
print(type(fruits))
fruits

<class 'pandas.core.series.Series'>

a     apples
b    oranges
c    bananas
dtype: object

In [19]:
fruitsdf = pd.DataFrame(["apples", "oranges", "bananas"], index=['a', 'b', 'c'],columns=['Fruits'])
print(type(fruitsdf))
fruitsdf

<class 'pandas.core.frame.DataFrame'>

    Fruits
a   apples
b  oranges
c  bananas

## Q5:

 What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

## Ans:
Functions used for data manupulation:<br>
pd.read_csv(" ")
<br>

df.dropna():Dropping the missing values in DataFrame, it can be done using the dropna() method, it removes all the NaN values in the dataframe.

<br>
pd.merge(df, df1):Merging DataFrames using merge(), arguments passed are the dataframes to be merged along with the column name
Sorting the DataFrame using sort_values() method.

## Q6:

Which of the following is mutable in nature Series, DataFrame, Panel?

Series:sizeimmutable.<br>
DataFrames:size-mutable array.<br>
Panel:size-mutable array.<br>

## Q7:

Create a DataFrame using multiple Series. Explain with an example.

In [24]:
#Creating two lists
author = ['Jitender', 'Purnima', 'Arpit', 'Jyoti']
article = [210, 211, 114, 178]


auth_series = pd.Series(author)
article_series = pd.Series(article)


frame = { 'Author': auth_series, 'Article': article_series }
#Creating DataFrame by passing Dictionary
result = pd.DataFrame(frame)
#Printing elements of Dataframe
result

     Author  Article
0  Jitender      210
1   Purnima      211
2     Arpit      114
3     Jyoti      178